students = {'Безуглов А.В.':1 , 'Бражко П.П.':2, "Ващенко А.В.":3, 'Горбатков С.А.':4, "Гугиев А.":5,
                 "Зелинский Д.Р.":6, "Ильинова Е.А.":7, "Колеухов В.А.":8, "Кононенко И.Д.":9,
                 "Кравченко Р.С.":10, "Круглянина А.Р.":11, "Кузмин Д.А.":12, "Курносенко Г.В.":13, "Лозинский Д.И.":14,
                 "Маджарян Р.А":15, "Мелихов А.Н.":16, "Михно Р.А.":17, "Рыбалкин А.В.":18, "Сапуголевцева Д.В.":19,
                 "Старунский Д.А.":20, "Струков М.А.":21, "Федченко Г.Г.":22, "Царев Н.И.":23, "Чернаявская Е.В.":24}

# print(list(students.keys())[0])
skiped = 4

now = list(students.keys())[0]
for i in range(skiped):
    students[list(students.keys())[i+1]] -= 1

students[now] = skiped+1

print(students)