students = {'Безуглов А.В.':1 , 'Бражко П.П.':2, "Ващенко А.В.":3, 'Горбатков С.А.':4, "Гугиев А.":5,
                 "Зелинский Д.Р.":6, "Ильинова Е.А.":7, "Колеухов В.А.":8, "Кононенко И.Д.":9,
                 "Кравченко Р.С.":10, "Круглянина А.Р.":11, "Кузмин Д.А.":12, "Курносенко Г.В.":13, "Лозинский Д.И.":14,
                 "Маджарян Р.А":15, "Мелихов А.Н.":16, "Михно Р.А.":17, "Рыбалкин А.В.":18, "Сапуголевцева Д.В.":19,
                 "Старунский Д.А.":20, "Струков М.А.":21, "Федченко Г.Г.":22, "Царев Н.И.":23, "Чернаявская Е.В.":24}

from datetime import time, date, datetime

now = datetime.now()
print("Current date and time:", now.strftime("%Y-%m-%d %H:%M:%S"))

print("Current date and time:", now.strftime("%H:%M:%S"))


print(time(8,0,0))